package com.bobo.security.core.validata.code.sms.codes;

import org.apache.commons.codec.binary.Base64;
import org.apache.commons.lang.StringUtils;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.data.redis.core.RedisTemplate;
import org.springframework.stereotype.Component;

import javax.imageio.ImageIO;
import java.io.ByteArrayOutputStream;
import java.io.IOException;
import java.util.ArrayList;
import java.util.Collections;
import java.util.HashMap;
import java.util.List;
import java.util.Map;
import java.util.Random;
import java.util.concurrent.TimeUnit;

/**
 * 文字验证码工具类
 * Created by Yhyu on 2018/6/8.
 */
@Component
public class CaptchaUtil {

    @Autowired
    private RedisTemplate<String, String> redisTemplate;

    private static final String SMS_COUNT_KEY = "girlx:sms:count:%s";
    private static final int SMS_COUNT_EXPIRE = 24 * 60;
    private static final String SMS_CAPTCHA_KEY = "girlx:sms:captcha:%s";
    private static final int SMS_CAPTCHA_EXPIRE = 10;

    //	private static int codeCount = ConfigReaderUtils.getInteger("captcha.codeCount", 4);
    private static int codeCount = 4;

    // 验证码 + 混淆字符个数
//	private static int totalCount = ConfigReaderUtils.getInteger("captcha.letterCount", 12);
    private static int totalCount = 12;

    private static String[] CAPTCHA_CODES = {"一干二净", "一日三秋", "一日千里", "一目十行", "一丝一毫", "一丝不苟", "一字千金", "一步登天", "一身正气", "一应俱全", "一呼百应", "一视同仁", "一览无余", "一举两得", "一落千丈", "一碧千里", "一暴十寒", "一箭双雕", "一麟半爪", "十万火急", "十马九稳", "十全十美", "七上八下", "七手八脚", "七拼八凑", "七零八落", "七颠八倒", "七嘴八舌", "人山人海", "人仰马翻", "人欢马叫", "人声鼎沸", "入木三分", "八面玲珑", "九牛一毛", "九死一生", "九霄云外", "刀山火海", "力争上游", "力挽狂澜", "三长两短", "三心二意", "三头六臂", "三言两语", "三顾茅庐", "三番五次", "才华横溢", "寸步难行", "大义凛然", "大好山河", "大材小用", "大言不惭", "大雨如注", "大雨倾盆", "大惊失色", "大智大勇", "万人空巷", "万马奔腾", "万无一失", "万木争荣", "万水千山", "万死一生", "万众一心", "万象更新", "万紫千红", "口出不逊", "口若悬河", "口是心非", "山穷水尽", "山明水秀", "千山万水", "千方百计", "千古绝唱", "千丝万缕", "千军万马", "千言万语", "千辛万苦", "千奇百怪", "千呼后拥", "千变万化", "千钧一发", "千姿百态", "千差万别", "千真万确", "千虑一失", "千虑一得", "千锤百炼", "千篇一律", "川流不息", "亡羊补牢", "门庭若市", "飞蛾扑火", "马到成功", "丰富多彩", "开卷有益", "天经地义", "无动于衷", "无穷无尽", "无奇不有", "无所不包", "无所顾忌", "无懈可击", "云雾迷蒙", "五光十色", "五花八门", "五彩缤纷", "五湖四海", "五颜六色", "不毛之地", "不计其数", "不甘示弱", "不可计数", "不可多得", "不屈不挠", "不骄不躁", "不耻下问", "车水马龙", "日积月累", "水天一色", "水平如镜", "水乳交融", "水泄不通", "水流湍急", "水滴石穿", "见礼忘义", "见多识广", "手不释卷", "手足轻深", "手足情深", "手疾眼快", "手舞足蹈", "气贯长虹", "长吁短叹", "化险为夷", "反败为胜", "分秒必争", "风云变幻", "风驰电掣", "风声鹤唳", "风雨无阻", "风雨同舟", "风雨交加", "风雨飘摇", "风卷残云", "风起云涌", "风调雨顺", "风清月朗", "凤毛麟角", "六神无主", "火树银花", "火烧眉毛", "为虎作伥", "斗志昂扬", "心平气和", "心安理得", "心旷神怡", "心急如焚", "心神不定", "心惊肉跳", "心慌意乱", "心猿意马", "心慈面善", "以少胜多", "玉宇琼楼", "未雨绸缪", "巧夺天工", "巧舌如簧", "功成不居", "功败垂成", "古树参天", "左顾右盼", "左推右挡", "龙飞凤舞", "龙马精神", "龙争虎斗", "龙跃凤鸣", "龙腾虎跃", "龙潭虎穴", "龙骧虎步", "平易近人", "东逃西散", "东倒西歪", "目不转睛", "目不暇接", "目中无人", "目空一切", "目瞪口呆", "叶公好龙", "由此及彼", "只争朝夕", "四分五裂", "四平八稳", "四面八方", "四面楚歌", "四通八达", "生龙活虎", "生死相依", "白练腾空", "鸟语花香", "包罗万象", "半信半疑", "头重脚轻", "头破血流", "宁缺毋滥", "永垂不朽", "出口成章", "出水芙蓉", "出类拔萃", "发奋图强", "对牛弹琴", "对答如流", "老态龙钟", "地动山摇", "扬长避短", "耳闻目睹", "过时黄花", "过眼云烟", "有口无心", "有头无尾", "有机可乘", "百孔千疮", "百花争艳", "百花齐放", "百里挑一", "百依百顺", "死而后已", "成人之美", "光明磊落", "同甘共苦", "先人后己", "丢盔弃甲", "优胜劣汰", "仰不愧天", "自我陶醉", "自鸣得意", "自命不凡", "自相矛盾", "自圆其说", "自高自大", "自强不息", "血雨腥风", "血浓于水", "行云流水", "全力以赴", "杀鸡吓猴", "负荆请罪", "多如牛毛", "争分夺秒", "争权夺利", "壮志凌云", "冰天雪地", "冰清玉洁", "妄自尊大", "闭月羞花", "问道于盲", "关怀备注", "江山如画", "兴国安邦", "守口如瓶", "守株待兔", "安步当车", "收回成命", "如火如荼", "如花似玉", "如鱼得水", "如狼似虎", "如雷贯耳", "如履平地", "观者如云", "欢呼雀跃", "买椟还珠", "弄假成真", "形影不离", "戒骄戒躁", "扶老携幼", "走马观花", "赤诚相待", "赤胆忠心", "志同道合", "声东击西", "花团锦簇", "花红柳绿", "花言巧语", "花枝招展", "克己奉公", "两面三刀", "两袖清风", "忐忑不安", "坚强不屈", "呆若木鸡", "足智多谋", "别有洞天", "利欲熏心", "兵不厌诈", "伶牙俐齿", "坐井观天", "含糊其词", "肝胆相照", "狂风暴雨", "应接不暇", "冷若冰霜", "弃旧图新", "忘乎所以", "闲言碎语", "沧海一粟", "没精打采", "沉鱼落雁", "完璧归赵", "层出不穷", "改朝换代", "张牙舞爪", "孜孜不倦", "妙语连珠", "鸡犬不宁", "鸡鸣狗盗", "纷至沓来", "青红皂白", "拔刀相助", "拐弯抹角", "顶天立地", "势如破竹", "抱头鼠窜", "抱薪救火", "披荆斩棘", "其貌不扬", "直言不讳", "杯弓蛇影", "杯水车薪", "枪林弹雨", "画龙点睛", "画蛇添足", "卖国求荣", "奔走相告", "奋不顾身", "转危为安", "虎背熊腰", "国色天香", "明眸皓齿", "昂首挺胸", "忠贞不渝", "垂头丧气", "和风细雨", "和蔼可亲", "迫不及待", "欣喜若狂", "舍己为人", "舍死忘生", "舍近求远", "金碧辉煌", "金蝉脱壳", "命中注定", "贪生怕死", "兔死狐悲", "狗急跳墙", "废寝忘食", "盲人摸象", "盲人瞎马", "刻不容缓", "刻舟求剑", "学无止境", "学而不厌", "学而不倦", "学贯中西", "学海无涯", "定时炸弹", "空前绝后", "居功自傲", "屈指可数", "承前启后", "孤云野鹤", "孤芳自赏", "春风化雨", "春光明媚", "春华秋实", "春色满圆", "春花秋月", "春雨如油", "春寒料峭", "春暖花开", "春意盎然", "持之以恒", "指鹿为马", "按图索骥", "挥汗如雨", "挥金如土", "荣辱与共", "故弄玄虚", "胡言乱语", "南腔北调", "南辕北辙", "勃然大怒", "威武不屈", "厚颜无耻", "面黄肌瘦", "鸦雀无声", "背井离乡", "临危不惧", "星罗棋布", "昨日黄花", "骨瘦如柴", "秋风送爽", "秋色宜人", "秋高气爽", "重峦叠嶂", "顺手牵羊", "促膝谈心", "胆大包天", "胆小如鼠", "急中生智", "亲密无间", "闻鸡起舞", "美不胜收", "美如冠玉", "美妙绝伦", "前所未有", "前赴后继", "前俯后仰", "前俯后继", "前倨后恭", "洪水猛兽", "洗耳恭听", "恬不知耻", "举一反三", "举不胜举", "举世瞩目", "举足轻重", "举袖为云", "语惊四座", "眉飞色舞", "眉开眼笑", "眉清目秀", "姹紫嫣红", "怒发冲冠", "骄阳似火", "络绎不绝", "绝无仅有", "班门弄斧", "蚕食鲸吞", "热火朝天", "真才实学", "真心诚意", "桃红柳绿", "恩重如山", "峰峦雄伟", "铁证如山", "铁杵成针", "铁树开花", "乘机而入", "积少成多", "积蚊成雷", "俯拾皆市", "爱财如命", "胸无点墨", "狼吞虎咽", "高山流水", "高山深涧", "高手如林", "高朋满座", "高耸入云", "高谈阔论", "高瞻远瞩", "座无虚席", "旁敲侧击", "粉妆玉砌", "粉身碎骨", "料事如神", "烘云托月", "烟波浩渺", "烟消云散", "浩如烟海", "海誓山盟", "浮云蔽日", "流水无情", "宽宏大度", "容光焕发", "袖手傍观", "调兵遣将", "谈笑风生", "弱不禁风", "能言善辩", "能说会道", "掩耳盗铃", "推心置腹", "黄雀在后", "虚怀若谷", "虚情假意", "晨光熹微", "眼花缭乱", "眼高手低", "眼疾手快", "悬崖峭壁", "悬梁刺股", "崇山峻岭", "银装素裹", "甜言蜜语", "笨鸟先飞", "悠然自得", "斜风细雨", "望而生畏", "望梅止渴", "深情厚谊", "情同手足", "惟我独尊", "惊弓之鸟", "惊天动地", "惊心动魄", "惊慌失措", "弹尽粮绝", "绿水青山", "绿草如茵", "绿树成荫", "琳琅满目", "博大精深", "博古通今", "喜出望外", "喜笑颜开", "凿壁偷光", "暑气蒸人", "跋山涉水", "蛛丝马迹", "铺天盖地", "锐不可当", "程门立雪", "集思广益", "皓月千里", "循序渐进", "道听途说", "湖光山色", "温故知新", "寒气袭人", "寒冬腊月", "富丽堂皇", "肆无忌惮", "勤能补拙", "蓬头垢面", "雷厉风行", "暗渡陈仓", "锦上添花", "锦绣山河", "锦绣河山", "愁眉苦脸", "愁眉紧锁", "鼠目寸光", "微乎其微", "鹏程万里", "腾云驾雾", "意气风发", "雍容华贵", "满园春色", "满城风雨", "滥竽充数", "滂沱大雨", "慎言谨行", "誓死不二", "蔚为壮观", "蜻蜓点水", "锲而不舍", "稳如泰山", "管中窥豹", "豪言壮语", "精忠报国", "漫山遍野", "漫不经心", "滴水不漏", "滴水穿石", "慢条斯理", "察言观色", "寥若晨星", "寥寥无几", "翠色欲流", "震耳欲聋", "暴风骤雨", "镇定自若", "摩肩接踵", "鹤立鸡群", "鹤发鸡皮", "鹤发童颜", "憨态可掬", "嬉皮笑脸", "融会贯通", "黔驴技穷", "燃眉之急", "鞠躬尽瘁", "螳螂捕蝉", "螳臂挡车", "繁花似锦", "豁达大度", "鹬蚌相争", "翻山越岭", "蟾宫折挂"};
//    private static String[] CAPTCHA_CODES = null;

    private static String[] CAPTCHA_LETTERS = {"一", "乙", "二", "丁", "十", "厂", "七", "人", "入", "八", "九", "儿", "几", "刁", "了", "乃", "刀", "力", "又", "三", "于", "干", "土", "士", "工", "才", "下", "寸", "丈", "大", "兀", "与", "万", "弋", "上", "小", "口", "山", "巾", "千", "乞", "川", "亿", "个", "丸", "久", "凡", "勺", "及", "夕", "广", "门", "义", "之", "己", "巳", "弓", "卫", "子", "也", "女", "习", "马", "乡", "丰", "王", "井", "开", "天", "夫", "元", "韦", "专", "云", "艺", "木", "五", "支", "厅", "不", "太", "区", "历", "友", "尤", "匹", "车", "巨", "牙", "屯", "比", "互", "切", "瓦", "止", "少", "日", "中", "内", "冈", "水", "贝", "见", "午", "手", "牛", "毛", "气", "壬", "升", "长", "仁", "什", "片", "仆", "仇", "化", "币", "仍", "仅", "斤", "反", "介", "从", "今", "分", "乏", "公", "仓", "月", "氏", "勿", "风", "丹", "匀", "凤", "勾", "卞", "六", "文", "亢", "方", "火", "为", "斗", "忆", "计", "订", "户", "认", "心", "尹", "尺", "引", "丑", "孔", "巴", "队", "以", "允", "邓", "双", "书", "幻", "玉", "刊", "未", "末", "示", "打", "巧", "正", "卉", "去", "甘", "世", "艾", "古", "节", "本", "术", "可", "匝", "丙", "左", "厉", "丕", "右", "石", "布", "戊", "平", "东", "卡", "北", "凸", "占", "业", "旧", "帅", "归", "且", "旦", "目", "叮", "叶", "甲", "申", "号", "电", "田", "由", "只", "史", "央", "兄", "叫", "另", "冉", "皿", "凹", "四", "生", "禾", "丘", "仕", "付", "仗", "代", "仙", "仟", "们", "仪", "白", "仔", "他", "仞", "瓜", "仝", "乎", "丛", "令", "甩", "印", "乐", "尔", "句", "册", "卯", "处", "外", "冬", "鸟", "务", "包", "主", "市", "立", "玄", "闪", "兰", "半", "汀", "汇", "头", "汉", "穴", "讨", "礼", "讫", "训", "必", "议", "记", "永", "司", "尼", "民", "弗", "弘", "疋", "出", "阡", "辽", "奶", "奴", "加", "召", "皮", "边", "发", "圣", "对", "台", "矛", "纠", "母", "幼", "匡", "邦", "玎", "式", "刑", "邢", "动", "圭", "寺", "吉", "扣", "托", "考", "圳", "老", "执", "圹", "扩", "地", "扬", "耳", "共", "亚", "芝", "朴", "机", "臣", "吏", "再", "协", "西", "戌", "在", "有", "百", "存", "而", "页", "匠", "夸", "灰", "达", "列", "成", "夷", "轨", "划", "迈", "毕", "至", "此", "贞", "师", "尘", "尖", "劣", "光", "当", "早", "虫", "曲", "团", "同", "吊", "吃", "因", "吸", "屿", "屹", "岁", "帆", "回", "则", "刚", "肉", "年", "朱", "先", "廷", "舌", "竹", "迁", "伟", "传", "休", "伍", "伎", "伏", "优", "臼", "伐", "仲", "件", "任", "价", "伦", "份", "仰", "伉", "自", "伊", "血", "向", "后", "行", "舟", "全", "合", "兆", "企", "爷", "朵", "夙", "旨", "旬", "旭", "负", "各", "名", "争", "色", "壮", "冲", "妆", "冰", "庄", "庆", "亦", "刘", "齐", "交", "次", "衣", "决", "亥", "充", "闭", "问", "羊", "并", "关", "米", "灯", "州", "江", "汕", "汐", "汛", "汜", "池", "汝", "汤", "忙", "兴", "宇", "守", "宅", "字", "安", "讲", "讳", "讴", "军", "论", "讼", "农", "讽", "设", "访", "诀", "聿", "那", "艮", "迅", "导", "异", "阮", "孙", "阵", "阳", "收", "阪", "阶", "阴", "防", "丞", "奸", "如", "妇", "妃", "好", "戏", "观", "牟", "欢", "买", "红", "纣", "约", "级", "纩", "纪", "驰", "巡", "寿", "弄", "玖", "麦", "玛", "形", "进", "吞", "运", "扶", "抚", "坛", "技", "坏", "拒", "坝", "贡", "攻", "赤", "圻", "坂", "扮", "孝", "坎", "均", "抑", "投", "坟", "抗", "坊", "志", "块", "报", "拟", "却", "抒", "芙", "苇", "邯", "芸", "苈", "芽", "芷", "花", "芩", "苍", "芳", "严", "芦", "劳", "克", "杆", "杜", "材", "村", "杖", "杏", "杉", "巫", "极", "杞", "李", "杨", "求", "甫", "更", "束", "吾", "豆", "两", "酉", "丽", "医", "辰", "励", "还", "矶", "奁", "来", "连", "轩", "步", "坚", "肖", "旱", "呈", "时", "吴", "助", "里", "呆", "园", "围", "町", "足", "邮", "男", "吵", "呗", "员", "听", "吟", "吻", "吹", "邑", "别", "帏", "岐", "岖", "岗", "帐", "岑", "岚", "财", "囵", "针", "钉", "牡", "告", "我", "利", "秀", "私", "每", "兵", "估", "体", "何", "佐", "伸", "佃", "作", "伯", "伶", "低", "你", "佟", "住", "位", "伴", "身", "皂", "伺", "佛", "伽", "近", "役", "返", "佘", "余", "希", "坐", "谷", "孚", "含", "邻", "肝", "肚", "肠", "龟", "甸", "奂", "免", "劬", "犹", "角", "条", "彤", "邹", "迎", "饭", "饮", "系", "言", "状", "亩", "况", "床", "库", "庇", "吝", "应", "冷", "这", "庐", "序", "冶", "忘", "闱", "间", "闵", "判", "灶", "弟", "沣", "汪", "沅", "沐", "沛", "汰", "沥", "沙", "沃", "汾", "泛", "沧", "沟", "沪", "沈", "沁", "怀", "忧", "快", "完", "宋", "宏", "究", "穷", "良", "证", "启", "评", "补", "初", "社", "识", "诊", "诋", "译", "诒", "君", "灵", "即", "层", "尾", "迟", "局", "改", "张", "际", "陆", "阿", "陇", "陈", "阻", "附", "陀", "妩", "妓", "妊", "妖", "妞", "姒", "努", "邵", "劭", "忍", "劲", "鸡", "纬", "纯", "纱", "纲", "纳", "纵", "纶", "纸", "纹", "纺", "驴", "纽", "纾", "奉", "玮", "环", "武", "青", "责", "玫", "表", "玟", "忝", "规", "卦", "拓", "拢", "拔", "坪", "拈", "坦", "担", "坤", "押", "者", "顶", "拥", "势", "抱", "拉", "幸", "拙", "招", "坡", "择", "抬", "其", "耶", "取", "苦", "昔", "若", "苹", "苗", "英", "苓", "茑", "苑", "范", "直", "茄", "茎", "茅", "林", "枝", "杯", "枢", "枥", "柜", "枇", "杳", "枚", "析", "板", "松", "枫", "构", "杭", "杰", "枕", "杷", "杼", "或", "画", "卧", "事", "刺", "卖", "郁", "矿", "码", "奈", "奔", "奇", "奋", "欧", "垄", "妻", "轰", "顷", "轮", "到", "非", "肯", "些", "卓", "虎", "肾", "贤", "尚", "旺", "具", "昙", "味", "果", "昆", "国", "昌", "畅", "明", "易", "昀", "昂", "迪", "典", "固", "忠", "鸣", "咏", "呢", "岢", "岸", "岩", "帖", "罗", "岿", "岫", "帜", "帙", "岭", "凯", "沓", "贩", "购", "贮", "图", "钏", "钓", "制", "知", "垂", "牧", "物", "和", "季", "委", "竺", "佳", "侍", "岳", "佬", "供", "使", "佰", "侑", "例", "侠", "侥", "版", "侄", "岱", "侦", "侗", "侣", "侃", "侏", "凭", "侨", "佻", "佩", "货", "侈", "侪", "依", "佯", "侬", "帛", "的", "迫", "阜", "质", "欣", "征", "往", "彼", "径", "所", "舍", "金", "刹", "命", "采", "觅", "受", "乳", "念", "肺", "朋", "股", "肪", "肥", "服", "周", "昏", "迩", "鱼", "兔", "忽", "炙", "饰", "饲", "冽", "变", "京", "享", "庞", "店", "夜", "庙", "府", "底", "卒", "庚", "废", "净", "妾", "盲", "放", "刻", "於", "育", "郑", "券", "卷", "单", "炜", "炊", "炎", "炉", "法", "河", "泷", "油", "泺", "沿", "泡", "注", "泞", "沱", "泌", "泳", "泓", "泽", "治", "性", "怕", "怡", "学", "宝", "宗", "定", "宕", "宜", "审", "宙", "官", "空", "宛", "实", "试", "诗", "肩", "房", "戽", "诚", "祉", "祈", "话", "诠", "询", "诣", "诤", "该", "详", "诩", "建", "录", "屉", "居", "届", "刷", "屈", "弥", "弦", "承", "孟", "陌", "亟", "函", "限", "姑", "妲", "姐", "妯", "姓", "姗", "妮", "始", "迢", "迦", "驾", "参", "线", "练", "组", "绅", "细", "织", "驷", "终", "驻", "驼", "绍", "驿", "经", "骀", "贯", "奏", "春", "帮", "珏", "玳", "珍", "玲", "珊", "珉", "玻", "型", "拭", "挂", "封", "持", "拱", "城", "政", "赴", "赵", "挡", "哉", "挺", "郝", "拾", "挑", "指", "挤", "按", "挥", "拯", "某", "甚", "革", "荐", "巷", "带", "莒", "茗", "荣", "荥", "故", "荩", "胡", "荫", "荔", "南", "荭", "栈", "柑", "柯", "柄", "枰", "查", "相", "柚", "柏", "栎", "栅", "柳", "柱", "栏", "柠", "柁", "树", "勃", "要", "酊", "咸", "威", "研", "厘", "厚", "砂", "砚", "砍", "面", "耐", "奎", "轶", "轸", "轻", "皆", "背", "战", "点", "临", "览", "竖", "省", "尝", "眄", "是", "郢", "眨", "眈", "哇", "显", "冒", "映", "星", "昨", "昱", "昭", "畏", "胃", "贵", "界", "虹", "蚁", "思", "盅", "虽", "品", "勋", "哗", "咱", "哈", "峙", "炭", "峡", "帧", "罚", "峥", "贴", "贻", "幽", "钚", "钜", "钟", "钠", "钢", "钥", "钧", "钮", "看", "矩", "牲", "选", "适", "秒", "香", "种", "秋", "科", "重", "复", "笃", "俦", "段", "便", "俩", "俪", "叟", "贷", "修", "俏", "保", "促", "俄", "俐", "俭", "俗", "信", "皇", "泉", "皈", "侵", "禹", "侯", "俟", "俊", "待", "徇", "衍", "律", "叙", "俞", "剑", "食", "盆", "胞", "胖", "脉", "匍", "勉", "狮", "狩", "狱", "贸", "急", "胤", "将", "奖", "哀", "亭", "亮", "度", "奕", "迹", "庭", "咨", "姿", "亲", "音", "彦", "帝", "施", "闺", "闻", "闾", "阀", "差", "养", "美", "姜", "叛", "送", "类", "娄", "前", "首", "兹", "总", "炳", "炸", "炮", "炷", "洁", "洪", "洹", "洞", "测", "活", "派", "洽", "染", "洵", "洛", "洋", "洲", "浑", "浒", "浓", "津", "洳", "恒", "恢", "恍", "恫", "恺", "恬", "恰", "举", "觉", "宣", "宦", "室", "宫", "宪", "突", "穿", "客", "冠", "语", "袄", "祜", "祖", "神", "祝", "祢", "祠", "诰", "诱", "说", "诵", "垦", "退", "屋", "屏", "费", "眉", "孩", "陛", "险", "院", "娃", "姨", "姻", "姝", "姚", "姣", "姹", "娜", "架", "贺", "盈", "勇", "怠", "癸", "柔", "绘", "给", "骆", "耕", "耘", "艳", "挈", "秦", "珙", "珠", "珩", "班", "珲", "敖", "素", "栽", "埔", "捕", "振", "载", "起", "埋", "捉", "捐", "袁", "都", "哲", "捡", "换", "热", "壶", "埃", "耻", "耿", "恭", "莱", "莲", "莳", "莫", "莉", "莠", "荷", "莅", "获", "莸", "晋", "莎", "莞", "莹", "莺", "真", "莼", "桂", "桔", "桓", "桢", "桐", "株", "梃", "桥", "桦", "桧", "桃", "格", "校", "样", "根", "逑", "索", "哥", "速", "栗", "贾", "酌", "配", "厝", "夏", "砧", "破", "原", "套", "烈", "殊", "顾", "轼", "轿", "顿", "致", "柴", "桌", "虔", "监", "紧", "逍", "党", "晟", "眠", "晓", "晃", "晏", "晕", "畔", "蚊", "圃", "恩", "崃", "峨", "峪", "峰", "圆", "峻", "钰", "钱", "钻", "铁", "铃", "铄", "铅", "铎", "特", "造", "乘", "敌", "秤", "租", "秧", "积", "秩", "秘", "俸", "倩", "借", "值", "倚", "倒", "倘", "俱", "倪", "倜", "俯", "倍", "健", "射", "皋", "息", "徒", "徕", "徐", "舰", "般", "航", "拿", "爹", "爱", "奚", "颁", "颂", "翁", "脐", "胶", "朕", "玺", "卿", "逢", "留", "馀", "凌", "恋", "浆", "高", "郭", "席", "准", "座", "效", "唐", "资", "站", "竞", "部", "旁", "旅", "旃", "畜", "阅", "羞", "瓶", "拳", "粉", "料", "益", "兼", "朔", "烛", "烟", "烙", "递", "涛", "浙", "酒", "消", "浩", "海", "涂", "浴", "涣", "涤", "流", "润", "浣", "浪", "涨", "悟", "悄", "悦", "悌", "害", "宽", "宸", "宵", "宴", "宾", "容", "宰", "案", "请", "朗", "诸", "诺", "读", "袖", "袍", "被", "祯", "祥", "课", "谁", "调", "谅", "谆", "谈", "谊", "恳", "展", "剧", "陵", "陲", "陶", "陪", "姬", "娱", "娟", "恕", "娩", "娴", "娘", "通", "预", "桑", "绢", "绣", "验", "骏", "理", "堵", "描", "掎", "掩", "捷", "排", "赦", "堆", "埠", "逵", "教", "掏", "培", "接", "探", "据", "掘", "职", "基", "勘", "娶", "菁", "著", "菘", "勒", "黄", "菖", "菜", "菩", "菸", "萍", "菀", "萤", "营", "乾", "萧", "萨", "械", "彬", "梦", "梗", "梧", "梅", "梯", "桶", "救", "匮", "曹", "副", "票", "硕", "爽", "雪", "辅", "彪", "雀", "堂", "常", "匙", "晨", "眼", "悬", "野", "圊", "曼", "冕", "晚", "趾", "跃", "略", "圉", "累", "唱", "患", "唯", "啸", "崧", "崎", "崭", "逻", "崔", "帷", "崞", "崇", "婴", "铛", "铝", "铧", "铨", "铬", "铭", "铮", "铲", "银", "甜", "梨", "移", "笼", "笙", "符", "第", "笞", "敏", "做", "偕", "悠", "偿", "偶", "售", "停", "偏", "皎", "假", "得", "衔", "盘", "舶", "船", "舷", "舵", "盒", "悉", "欲", "彩", "领", "翎", "够", "逸", "猪", "凰", "祭", "馆", "凑", "毫", "孰", "庶", "麻", "痔", "廊", "康", "庸", "竟", "商", "族", "旋", "阊", "盖", "眷", "粗", "断", "剪", "兽", "焕", "烽", "添", "渚", "鸿", "淞", "涯", "渐", "混", "淮", "淦", "渊", "淝", "渔", "淘", "液", "淡", "渖", "涵", "婆", "梁", "惟", "惮", "惯", "寇", "寅", "寄", "宿", "窕", "密", "谋", "谌", "谐", "祷", "谒", "谓", "谕", "谙", "谛", "逮", "敢", "尉", "屠", "艴", "弹", "隋", "随", "隗", "隆", "隐", "婧", "婚", "婵", "婉", "颇", "翌", "绩", "绪", "绫", "续", "绮", "骑", "绰", "绳", "绵", "绸", "综", "绿", "巢", "琴", "琶", "琪", "瑛", "琳", "琦", "琥", "琨", "琼", "斑", "琰", "琬", "琛", "替", "款", "塔", "越", "堤", "提", "博", "喜", "彭", "煮", "援", "握", "揆", "联", "葳", "募", "葛", "蒉", "葸", "董", "葆", "葡", "敬", "蒋", "葶", "蒂", "落", "萱", "韩", "朝", "辜", "葵", "棒", "椰", "植", "椅", "椒", "棉", "棚", "榔", "惠", "酣", "厨", "厦", "确", "雁", "殖", "颊", "雳", "雯", "暂", "辍", "雅", "辈", "紫", "辉", "棠", "赏", "掌", "量", "鼎", "喋", "晶", "景", "践", "遗", "蛟", "喻", "喧", "幅", "帽", "幄", "嵋", "赋", "赐", "淼", "黑", "铸", "铺", "链", "铿", "销", "锁", "锆", "锈", "锋", "锐", "智", "筐", "筑", "筵", "筝", "傅", "牌", "堡", "集", "焦", "傍", "储", "皓", "奥", "街", "畲", "逾", "番", "释", "腑", "鲁", "颍", "然", "装", "就", "敦", "斌", "瓿", "普", "奠", "道", "遂", "焰", "焱", "港", "湖", "渺", "湿", "温", "渭", "湍", "滑", "渝", "湾", "渡", "游", "渥", "惶", "愧", "寒", "富", "寓", "扉", "裕", "裙", "祺", "谦", "犀", "属", "弼", "强", "隘", "媒", "媛", "婷", "媚", "婺", "缋", "缓", "缔", "编", "缘", "瑟", "瑚", "瑞", "瑰", "瑜", "瑗", "瑙", "韫", "鼓", "摇", "塘", "聘", "斟", "勤", "蓝", "幕", "蓓", "蓊", "蓄", "蒲", "蓉", "蒙", "颐", "蒸", "献", "蓣", "椿", "楠", "楚", "楷", "想", "楸", "槐", "榆", "楼", "概", "楣", "赖", "甄", "酩", "感", "碑", "碗", "雷", "雾", "辑", "输", "粲", "虞", "鉴", "睦", "睡", "暖", "盟", "煦", "暄", "路", "蛾", "蜂", "畹", "嗣", "署", "置", "蜀", "嵩", "错", "锚", "锡", "锦", "锭", "键", "稔", "稠", "筹", "筠", "筮", "简", "催", "像", "魁", "衙", "腰", "腹", "鹏", "腾", "腿", "詹", "肄", "颖", "解", "鹑", "禀", "廓", "裔", "靖", "新", "韵", "意", "雍", "粮", "数", "慈", "煤", "煜", "满", "漠", "滇", "源", "滤", "裟", "滏", "溪", "溜", "溢", "溯", "滨", "溶", "滩", "慎", "誉", "塞", "窥", "窦", "谨", "褚", "福", "群", "殿", "嫁", "嫔", "叠", "缙", "缝", "缤", "静", "碧", "瑶", "瑷", "熬", "摧", "誓", "摘", "鞅", "慕", "暮", "蔓", "蔗", "蔼", "斡", "熙", "蔚", "兢", "嘏", "模", "榜", "槟", "榕", "槠", "歌", "酿", "厮", "磁", "愿", "需", "霆", "辗", "裴", "翡", "雌", "裳", "墅", "蝉", "嶂", "赚", "锻", "锵", "镀", "稳", "熏", "箕", "算", "管", "舆", "僖", "僚", "僦", "膑", "鲜", "銮", "豪", "膏", "塾", "遮", "廖", "彰", "韶", "端", "旗", "阚", "精", "粹", "漂", "漫", "滴", "漩", "演", "潍", "慢", "慷", "寨", "赛", "搴", "蜜", "谭", "谯", "谱", "暨", "嫣", "嫩", "嫡", "翠", "熊", "缨", "慧", "瑾", "璎", "璋", "璇", "趣", "播", "墩", "增", "撰", "聪", "鞍", "蕉", "蕃", "蕊", "蕴", "横", "樱", "樊", "橡", "樟", "橄", "飘", "醇", "醉", "震", "霄", "题", "暹", "影", "蝶", "幡", "幢", "嶙", "墨", "镆", "镇", "镒", "镔", "靠", "稽", "稷", "稻", "黎", "稿", "箱", "箴", "箭", "篇", "德", "徵", "磐", "膝", "膛", "鲤", "熟", "摩", "麾", "褒", "毅", "糍", "翦", "遵", "熠", "澍", "潮", "潭", "澳", "潘", "澈", "澄", "懂", "憧", "额", "鹤", "谵", "慰", "劈", "履", "豫", "操", "熹", "擅", "磬", "薛", "薇", "薪", "薏", "薜", "樵", "橹", "橙", "橘", "整", "融", "醒", "霖", "霓", "辚", "臻", "瞰", "蹄", "器", "鹦", "默", "镘", "镜", "镞", "镟", "赞", "篮", "篷", "篙", "篱", "儒", "邀", "衡", "雕", "鲸", "磨", "斓", "辩", "糕", "甑", "燧", "濑", "濒", "潞", "澡", "激", "黉", "禧", "壁", "嬖", "颡", "璐", "戴", "壕", "藉", "藏", "薰", "霜", "霞", "瞳", "曙", "镦", "穗", "簇", "繁", "黛", "爵", "朦", "臆", "襄", "膺", "赢", "糠", "擘", "翼", "藕", "藜", "藤", "藩", "颢", "镬", "镭", "镯", "馥", "鹰", "癖", "瀑", "襟", "璧", "彝", "警", "麓", "攀", "霭", "籁", "簿", "鳗", "鳙", "蟹", "瀚", "瀛", "疆", "骥", "壤", "攘", "馨", "蘩", "耀", "曦", "籍", "鳞", "灌", "孀", "骧", "霸", "露", "赣", "懿", "鹳", "镶", "灒", "罐", "戆"};
//    private static String[] CAPTCHA_LETTERS = null;

    public int getSMSCount(String phone) {
        String count = (String) redisTemplate.opsForValue().get(String.format(SMS_COUNT_KEY, phone));
        if (count == null) {
            count = "0";
        }
        return new Integer(count);
    }

    public void setSMSCount(String phone, int count) {
        redisTemplate.opsForValue().set(String.format(SMS_COUNT_KEY, phone), count + "", SMS_COUNT_EXPIRE, TimeUnit.MINUTES);
    }

    public Map<String, String> getCaptcha(String phoneNum) {
        try {
            Map<String, String> result = new HashMap<>();

            String randomCode = getRandomCode();
            SCaptcha instance = new SCaptcha(randomCode);
            // 获取待输入的验证码
            String code = instance.getCode();
            // 待输入的验证码入缓存，登录输入时做校验
            String key = String.format(SMS_CAPTCHA_KEY, phoneNum);
            redisTemplate.opsForValue().set(key, code, SMS_CAPTCHA_EXPIRE, TimeUnit.MINUTES);
            List<String> letters = getCodeAndLetters(code);
            String ls = StringUtils.join(letters, ",");

            //ajax无法用流的形式解析图片，只能返回string了
            ByteArrayOutputStream baos = new ByteArrayOutputStream();
            ImageIO.write(instance.getBuffImg(), "png", baos);
            byte[] bytes = baos.toByteArray();
            result.put("img", Base64.encodeBase64String(bytes));
            result.put("codes", ls);

            return result;
        } catch (IOException e) {
            e.printStackTrace();
        }
        return null;
    }
    /**
     * Description: 校验验证码有效性
     * @Version1.0 2015年6月12日 下午4:51:18 by 代鹏（daipeng@dangdang.com）创建
     * @param code
     * @return
     */
    public boolean checkCaptchaCode(String code, String phoneNum){
        if(StringUtils.isBlank(code) || StringUtils.isBlank(phoneNum)){
            return false;
        }
        String cacheCode = getCodeFromCache(phoneNum);
        if(StringUtils.isEmpty(cacheCode)){
            return false;
        }
        if(code.equals(cacheCode)){
            //校验成功，清楚缓存中验证码
//			clearCaptchaCode(phoneNum, type);
            return true;
        }
        clearCaptchaCode(phoneNum);
        return false;
    }
    /**
     * 从缓存取出code
     * Description:
     * @Version1.0 2015-2-2 下午03:30:18 by 王冠华（wangguanhua@dangdang.com）创建
     * @return
     */
    public String getCodeFromCache(String phoneNum){
        String key = String.format(SMS_CAPTCHA_KEY, phoneNum);
        return (String) redisTemplate.opsForValue().get(key);
    }

    public void clearCaptchaCode(String phoneNum){
        String key = String.format(SMS_CAPTCHA_KEY, phoneNum);
        redisTemplate.delete(key);
    }
    /**
     * 获取随机验证码
     * Description:
     *
     * @return
     * @Version1.0 2015-2-2 下午04:42:46 by 王冠华（wangguanhua@dangdang.com）创建
     */
    public String getRandomCode() {
        if (CAPTCHA_CODES == null) {
//            ISystemConfigApi systemConfigApi = SpringContextHolder.getBean("systemConfigApi");
//            ResponseVo<String> responseData = systemConfigApi.getConfig("captcha.codes");
//            if (responseData == null || !"0".equals(responseData.getCode())) {
//                throw ISayExcepiton.InerError;
//            }
//            String codes = responseData.getData();
//            if (StringUtils.isNotBlank(codes)) {
//                CAPTCHA_CODES = codes.split(",");
//            }
        }
        int length = CAPTCHA_CODES.length;
        int index = (new Random()).nextInt(length);
        String code = CAPTCHA_CODES[index];
        if (code.length() == codeCount) {
            return code;
        }
        return null;
    }
    /**
     * 获取验证码与混淆字符的集合
     * Description:
     * @Version1.0 2015-2-2 下午05:40:26 by 王冠华（wangguanhua@dangdang.com）创建
     * @param code
     * @return
     */
    public List<String> getCodeAndLetters(String code){
        if (StringUtils.isBlank(code) || getLetters() == null) {
            return null;
        }

        List<String> letters = new ArrayList<String>();
        char [] cs = code.toCharArray();
        for (int i = 0; i < cs.length; i++) {
            letters.add(String.valueOf(cs[i]));
        }

        Random r = new Random();
        while (letters.size() != totalCount) {
            int index = r.nextInt(CAPTCHA_LETTERS.length);
            letters.add(CAPTCHA_LETTERS[index]);
        }
        Collections.shuffle(letters);
        return letters;
    }
    /**
     * 获取混淆字符
     * Description:
     * @Version1.0 2015-2-2 下午04:46:25 by 王冠华（wangguanhua@dangdang.com）创建
     * @return
     */
    public String[] getLetters() {
        if (CAPTCHA_LETTERS == null) {
//            ISystemConfigApi systemConfigApi = SpringContextHolder.getBean("systemConfigApi");
//            ResponseVo<String> responseData = systemConfigApi.getConfig("captcha.letters");
//            if(responseData == null || !"0".equals(responseData.getCode())){
//                throw ZeusException.DbError;
//            }
//            String codes = responseData.getData();
//            if (StringUtils.isNotBlank(codes)) {
//                CAPTCHA_LETTERS = codes.split(",");
//            }
        }
        return CAPTCHA_LETTERS;
    }

}
